#include "shapes.h"


const std::vector<GLfloat> cubeVertices = {
    //Координаты x,y,z и текстурные координаты s, t
   // Задняя грань
    -0.5f, -0.5f, -0.5f,   0.0f, 0.0f,  // Нижний левый
     0.5f, -0.5f, -0.5f,   1.0f, 0.0f,  // Нижний правый
     0.5f,  0.5f, -0.5f,   1.0f, 1.0f,  // Верхний правый
     0.5f,  0.5f, -0.5f,   1.0f, 1.0f,  // Верхний правый
    -0.5f,  0.5f, -0.5f,   0.0f, 1.0f,  // Верхний левый
    -0.5f, -0.5f, -0.5f,   0.0f, 0.0f,  // Нижний левый

    // Передняя грань
    -0.5f, -0.5f,  0.5f,   0.0f, 0.0f,  // Нижний левый
     0.5f, -0.5f,  0.5f,   1.0f, 0.0f,  // Нижний правый
     0.5f,  0.5f,  0.5f,   1.0f, 1.0f,  // Верхний правый
     0.5f,  0.5f,  0.5f,   1.0f, 1.0f,  // Верхний правый
    -0.5f,  0.5f,  0.5f,   0.0f, 1.0f,  // Верхний левый
    -0.5f, -0.5f,  0.5f,   0.0f, 0.0f,  // Нижний левый

    // Левая грань
    -0.5f,  0.5f,  0.5f,   1.0f, 0.0f,  // Верхний правый
    -0.5f,  0.5f, -0.5f,   1.0f, 1.0f,  // Верхний левый
    -0.5f, -0.5f, -0.5f,   0.0f, 1.0f,  // Нижний левый
    -0.5f, -0.5f, -0.5f,   0.0f, 1.0f,  // Нижний левый
    -0.5f, -0.5f,  0.5f,   0.0f, 0.0f,  // Нижний правый
    -0.5f,  0.5f,  0.5f,   1.0f, 0.0f,  // Верхний правый

    // Правая грань
     0.5f,  0.5f,  0.5f,   1.0f, 0.0f,  // Верхний левый
     0.5f,  0.5f, -0.5f,   1.0f, 1.0f,  // Верхний правый
     0.5f, -0.5f, -0.5f,   0.0f, 1.0f,  // Нижний правый
     0.5f, -0.5f, -0.5f,   0.0f, 1.0f,  // Нижний правый
     0.5f, -0.5f,  0.5f,   0.0f, 0.0f,  // Нижний левый
     0.5f,  0.5f,  0.5f,   1.0f, 0.0f,  // Верхний левый

     // Нижняя грань
     -0.5f, -0.5f, -0.5f,   0.0f, 1.0f,  // Верхний левый
      0.5f, -0.5f, -0.5f,   1.0f, 1.0f,  // Верхний правый
      0.5f, -0.5f,  0.5f,   1.0f, 0.0f,  // Нижний правый
      0.5f, -0.5f,  0.5f,   1.0f, 0.0f,  // Нижний правый
     -0.5f, -0.5f,  0.5f,   0.0f, 0.0f,  // Нижний левый
     -0.5f, -0.5f, -0.5f,   0.0f, 1.0f,  // Верхний левый

     // Верхняя грань
     -0.5f,  0.5f, -0.5f,   0.0f, 1.0f,  // Верхний левый
      0.5f,  0.5f, -0.5f,   1.0f, 1.0f,  // Верхний правый
      0.5f,  0.5f,  0.5f,   1.0f, 0.0f,  // Нижний правый
      0.5f,  0.5f,  0.5f,   1.0f, 0.0f,  // Нижний правый
     -0.5f,  0.5f,  0.5f,   0.0f, 0.0f,  // Нижний левый
     -0.5f,  0.5f, -0.5f,   0.0f, 1.0f   // Верхний левый
};

const std::vector<GLfloat> tetrahedronVertices = {
    //Координаты x,y,z и цвет r, g, b
     // Грань 1
     0.0f,  0.5f,  0.0f,    1.0f, 0.0f, 0.0f,  // Вершина 1
    -0.5f, -0.5f,  0.5f,    0.0f, 1.0f, 0.0f,  // Вершина 2
     0.5f, -0.5f,  0.5f,    0.0f, 0.0f, 1.0f,  // Вершина 3

     // Грань 2
      0.0f,  0.5f,  0.0f,    1.0f, 0.0f, 0.0f,  // Вершина 1
      0.5f, -0.5f,  0.5f,    0.0f, 0.0f, 1.0f,  // Вершина 3
      0.0f, -0.5f, -0.5f,    1.0f, 1.0f, 0.0f,  // Вершина 4

      // Грань 3
       0.0f,  0.5f,  0.0f,    1.0f, 0.0f, 0.0f,  // Вершина 1
       0.0f, -0.5f, -0.5f,    1.0f, 1.0f, 0.0f,  // Вершина 4
      -0.5f, -0.5f,  0.5f,    0.0f, 1.0f, 0.0f,  // Вершина 2

      // Грань 4 (основание)
      -0.5f, -0.5f,  0.5f,    0.0f, 1.0f, 0.0f,  // Вершина 2
       0.5f, -0.5f,  0.5f,    0.0f, 0.0f, 1.0f,  // Вершина 3
       0.0f, -0.5f, -0.5f,    1.0f, 1.0f, 0.0f   // Вершина 4
};